app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    user = User.new(params_user_search)
    @users = user.search